{
  "Sobre": "About",
  "Projetos": "Projects",
  "Experiências": "Experiences",
  "Currículo": "Curriculum",
  "Olá": "Hello",
  "Me chamo": "My name is",
  "e sou": "and I am a",
  "Desenvolvedor Frontend": "Frontend Developer",
  "Nordestino, moro em Sr. do Bonfim, interior da Bahia.": "From the Northeast, I live in Senhor do Bonfim, in the interior of Bahia.",
  "Apaixonado por Ciência, Tecnologia, Web e entusiasta de UX/UI.": "Passionate about Science, Technology, Web, and UX/UI enthusiast.",
  "Amo gatos, música e jogos indie, principalmente os feitos em Pixel Art.": "I love cats, music, and indie games, especially those made in Pixel Art.",
  "Tenho experiência com ReactJS, TypeScript, NextJS, TailwindCSS, ChakraUI entre outras bibliotecas de desenvolvimento web. Possuo conhecimento em desenvolvimento Backend com NestJS, Prisma e Express.": "I have experience with ReactJS, TypeScript, NextJS, TailwindCSS, ChakraUI, and other web development libraries. I have knowledge of backend development with NestJS, Prisma, and Express.",
  "Atualmente estou estudando VueJS, Python e Aprendizado de Máquina.": "I am currently studying VueJS, Python, and Machine Learning.",
  "Dev Frontend Jr ~ (PJ na Brainny Smart Solutions)": "Frontend Dev Jr ~ (Freelance at Brainny Smart Solutions)",
  "Prestação de serviços para reparo e criação de novas funcionalidades em aplicações web de administração, assim como em landing pages, usando tecnologias web como React, TypeScript, ChakraUI, Apollo e GraphQL. Atuação em uma equipe ágil seguindo metodologias do Scrum (dailies, reviews, plannings, sprints, etc) para desenvolver soluções web eficientes e de alta qualidade.": "Freelance work for repair and creation of new features in web administration applications, as well as landing pages, using web technologies such as React, TypeScript, ChakraUI, Apollo, and GraphQL. Worked in an agile team following Scrum methodologies (dailies, reviews, plannings, sprints, etc.) to develop efficient and high-quality web solutions.",
  "Tempo de atuação": "Working time",
  "Setembro de 2021 - Outubro de 2022": "September 2021 - October 2022",
  "Dev Frontend Jr ~ (Freelancer na SystemHope - Agência de Software)": "Frontend Dev Jr ~ (Freelance at SystemHope - Software Agency)",
  "Reparos e criação de novas funcionalidades em aplicações web de administração, como também num projeto de plataforma EAD, utilizando React, TypeScript e ChakraUI como principais tecnologias.": "Repair and creation of new features in web administration applications, as well as in a project for an distance learning platform, using React, TypeScript, and ChakraUI as the main technologies.",
  "Maio de 2020 - Novembro de 2020": "May 2020 - November 2020"
}
