{
  "Sobre": "About",
  "Olá": "Hello",
  "Me chamo": "My name is",
  "e sou": "and I am a",
  "Desenvolvedor Web": "Web Developer",
  "Nordestino, moro em Sr. do Bonfim, interior da Bahia.": "From the Northeast, I live in Senhor do Bonfim, Bahia countryside.",
  "Apaixonado por ciência e tecnologia, sou Desenvolvedor Web com 3 anos de experiência, sendo 2 anos em software house e 1 ano como freelancer. Atuei em projetos de Dashboards, Gestão de serviços, Controle de vendas, LandingPages e SaaS no geral utilizando NextJS, ReactJS, TypeScript entre outras tecnologias web. Tenho conhecimento em Angular, VueJS, Docker, Jest, Testing Library e no que diz respeito a desenvolvimento Backend: Prisma, Express e NestJS.": "A technology enthusiast with a strong passion for science, I am a Web Developer with three years of experience—two years in a software house and one as a freelancer. I have worked on projects involving dashboards, service management, sales control, landing pages, and SaaS platforms using technologies like NextJS, ReactJS, TypeScript, and other web frameworks. I also have experience with Angular, VueJS, Docker, Jest, Testing Library, and backend development tools such as Prisma, Express, and NestJS.",
  "Prezo pela comunicação e pela cooperação na equipe, assim também como a transparência de informações. Gosto de um ambiente de trabalho que possui segurança psicológica. Aprendo e me adapto rápido às mudanças.": "I value clear communication and team cooperation, as well as information transparency. I thrive in a work environment with psychological safety. Im a quickly learner and adapter to new changes.",

  "Experiências": "Experiences",
  "Dev Frontend Jr ~ (PJ na Brainny Smart Solutions)": "Frontend Dev Jr ~ (Freelance at Brainny Smart Solutions)",
  "Responsável pelo reparo e criação de novas funcionalidades em aplicações web de administração, dashboards, gestão/agendamento de serviços, assim como em landing pages, usando tecnologias web como React, TypeScript, ChakraUI, Apollo e GraphQL. Atuação em uma equipe ágil seguindo metodologias do Scrum (dailies, reviews, plannings, sprints, etc).": "Responsible for repairing and creating new features in web applications for administration, dashboards, service management/scheduling, as well as landing pages, using web technologies such as React, TypeScript, ChakraUI, Apollo, and GraphQL. Worked within an agile team following Scrum methodologies (dailies, reviews, planning, sprints, etc.).",
  "Tempo de atuação": "Working time",
  "Setembro de 2021 - Outubro de 2022": "September 2021 - October 2022",
  "Dev Frontend Jr ~ (Freelancer na SystemHope - Agência de Software)": "Frontend Dev Jr ~ (Freelance at SystemHope - Software Agency)",
  "Responsável pelo reparo e criação de funcionalidades em sistemas web de administração, dashboards, controles de estoque e também num projeto de plataforma de vídeos usando React, Styled Components, MaterialUI, ChakraUI, React Router entre outras tecnologias.": "Responsible for repairing and creating features in web systems for administration, dashboards, inventory control, and also in a video platform project using React, Styled Components, MaterialUI, ChakraUI, React Router, among other technologies.",
  "Maio de 2020 - Janeiro de 2021": "May 2020 - January 2021",

  "Currículo": "Curriculum",
  "React e NextJS": "React and NextJS",
  "Experiência em desenvolvimento de aplicações web com React e NextJS, incluindo criação de componentes reutilizáveis, gerenciamento de estado com Context API, Zustand e Redux. Roteamento de páginas com React Router e Pages/App folder do NextJS.": "Experience in developing web applications with React and NextJS, including the creation of reusable components, state management with Context API, Zustand, and Redux. Page routing with React Router and NextJS's Pages/App folder.",
  "UX e Clean Code": "UX and Clean Code",
  "Conhecimentos em UX/UI para criação de interfaces amigáveis e legíveis. Boas práticas de desenvolvimento de código limpo e legível.": "Knowledge in UX/UI for creating user-friendly and readable interfaces. Best practices for clean and readable code development.",
  "TypeScript e Python": "TypeScript and Python",
  "Experiência sólida em desenvolvimento com TypeScript e também Python.": "Solid experience in development with TypeScript and Python.",
  "Metodologias ágeis": "Agile Methodologies",
  "Experiência em trabalhar em equipe ágil seguindo as metodologias do Scrum. Incluindo sprints, dailies, reviews, etc.": "Experience in working in an agile team following Scrum methodologies. Including sprints, dailies, reviews, etc.",
  "ChakraUI, TailwindCSS e StyledComponents": "ChakraUI, Tailwind CSS, and StyledComponents",
  "Experiência em desenvolvimento de interfaces responsivas com ChakraUI, Tailwind CSS e StyledComponents.": "Experience in developing responsive interfaces with ChakraUI, Tailwind CSS, and StyledComponents.",
  "Inglês intermediário": "Intermediate English",
  "Compreensão e comunicação em inglês intermediário.": "Intermediate-level understanding and communication in English.",
  "TDD": "TDD",
  "Testes unitários e de integração usando Jest, React Testing Library e Mock Service Worker (MSW)": "Unit and integration testing using Jest, React Testing Library, and Mock Service Worker (MSW)",
  "Conhecimentos em Backend": "Backend Knowledge",
  "NodeJS e Express": "NodeJS and Express",
  "Experiência no desenvolvimento de aplicativos utilizando o ambiente de execução do Nodejs e Express.": "Experience in developing applications using the Node.js runtime environment and Express.",
  "NestJS": "NestJS",
  "Prisma": "Prisma",
  "Familiaridade com o framework NestJS para construção de aplicativos server-side.": "Familiarity with the NestJS framework for building server-side applications.",
  "Experiência no uso do Prisma como ORM (Object-Relational Mapping) para interagir com bancos de dados.": "Experience in using Prisma as an Object-Relational Mapping (ORM) to interact with databases."
}
