{
  "Sobre": "About",
  "Olá": "Hello",
  "Me chamo": "My name is",
  "e sou": "and I am a",
  "Desenvolvedor Frontend": "Frontend Developer",
  "Nordestino, moro em Sr. do Bonfim, interior da Bahia.": "From the Northeast, I live in Senhor do Bonfim, Bahia countryside.",
  "Apaixonado por Ciência, Tecnologia, Web e entusiasta de UX/UI.": "Passionate about Science, Technology, Web, and UX/UI enthusiast.",
  "Amo gatos, música e jogos indie, principalmente os feitos em Pixel Art.": "I love cats, music, and indie games, especially those made in Pixel Art.",
  "Tenho experiência com ReactJS, TypeScript, NextJS, TailwindCSS, ChakraUI entre outras bibliotecas de desenvolvimento web. Possuo conhecimento em desenvolvimento Backend com NestJS, Prisma e Express.": "I have experience with ReactJS, TypeScript, NextJS, TailwindCSS, ChakraUI, and other web development libraries. I have knowledge of backend development with NestJS, Prisma, and Express.",
  "Atualmente estou estudando VueJS, Python e Aprendizado de Máquina.": "Currently I am studying VueJS, Python, and Machine Learning.",

  "Projetos": "Projects",
  "Shoping cart with Tests": "Shoping cart with Tests",
  "Shopping cart feito com NextJS e que possui testes unitários": "Shopping cart built with Next.js and has unit tests",
  "Upload AI (NLW AI)": "Upload AI (NLW AI)",
  "Cria resultados gerados pela API da OpenAI a partir de prompts pré-cadastrados, para vídeos.": "Generates results using the OpenAI API from pre-registered prompts for videos.",
  "Coinsynch (desafio vaga)": "Coinsynch (job challenge)",
  "Aplicação que simula uma carteira de Cryptomoedas na qual o usuário pode se registrar, logar, fazer logout, adicionar moedas em sua carteira, remover, vender e/ou trocar e também se inscrever na Newsletter.": "An application that simulates a cryptocurrency wallet where users can register, log in, log out, add coins to their wallet, remove, sell and/or exchange, and also subscribe to the Newsletter.",
  "Capsula do Tempo (NLW Spacetime)": "Time Capsule (NLW Spacetime)",
  "O usuário pode salvar memórias, escrever sobre elas e adicionar fotos/vídeos. Com versões web e mobile, login através do Github e funcionalidades para tornar as memórias públicas ou privadas.": "Users can save memories, write about them and add photos/videos. With web and mobile versions, login through Github, and features to make memories public or private.",
  "John's Task List (desafio vaga)": "John's Task List (job challenge)",
  "CRUD de tarefas com subtarefas.": "CRUD of tasks with subtasks.",

  "Experiências": "Experiences",
  "Dev Frontend Jr ~ (PJ na Brainny Smart Solutions)": "Frontend Dev Jr ~ (Freelance at Brainny Smart Solutions)",
  "Prestação de serviços para reparo e criação de novas funcionalidades em aplicações web de administração, assim como em landing pages, usando tecnologias web como React, TypeScript, ChakraUI, Apollo e GraphQL. Atuação em uma equipe ágil seguindo metodologias do Scrum (dailies, reviews, plannings, sprints, etc) para desenvolver soluções web eficientes e de alta qualidade.": "Freelance work for repair and creation of new features in web administration applications, as well as landing pages, using web technologies such as React, TypeScript, ChakraUI, Apollo, and GraphQL. Worked in an agile team following Scrum methodologies (dailies, reviews, plannings, sprints, etc.) to develop efficient and high-quality web solutions.",
  "Tempo de atuação": "Working time",
  "Setembro de 2021 - Outubro de 2022": "September 2021 - October 2022",
  "Dev Frontend Jr ~ (Freelancer na SystemHope - Agência de Software)": "Frontend Dev Jr ~ (Freelance at SystemHope - Software Agency)",
  "Reparos e criação de novas funcionalidades em aplicações web de administração, como também num projeto de plataforma EAD, utilizando React, TypeScript e ChakraUI como principais tecnologias.": "Fix and creation of new features in web administration applications, as well as in a project for an distance learning platform, using React, TypeScript, and ChakraUI as the main technologies.",
  "Maio de 2020 - Novembro de 2020": "May 2020 - November 2020",

  "Currículo": "Curriculum",
  "React e NextJS": "React and NextJS",
  "Experiência em desenvolvimento de aplicações web com React e NextJS, incluindo criação de componentes reutilizáveis, gerenciamento de estado com Context API, Zustand e Redux. Roteamento de páginas com React Router e Pages/App folder do NextJS.": "Experience in developing web applications with React and NextJS, including the creation of reusable components, state management with Context API, Zustand, and Redux. Page routing with React Router and NextJS's Pages/App folder.",
  "UX e Clean Code": "UX and Clean Code",
  "Conhecimentos em UX/UI para criação de interfaces amigáveis e legíveis. Boas práticas de desenvolvimento de código limpo e legível.": "Knowledge in UX/UI for creating user-friendly and readable interfaces. Best practices for clean and readable code development.",
  "TypeScript": "TypeScript",
  "Experiência sólida em desenvolvimento com TypeScript.": "Solid experience in development with TypeScript.",
  "Metodologias ágeis": "Agile Methodologies",
  "Experiência em trabalhar em equipe ágil seguindo as metodologias do Scrum. Incluindo sprints, dailies, reviews, etc.": "Experience in working in an agile team following Scrum methodologies. Including sprints, dailies, reviews, etc.",
  "ChakraUI, TailwindCSS e StyledComponents": "ChakraUI, Tailwind CSS, and StyledComponents",
  "Experiência em desenvolvimento de interfaces responsivas com ChakraUI, Tailwind CSS e StyledComponents.": "Experience in developing responsive interfaces with ChakraUI, Tailwind CSS, and StyledComponents.",
  "Inglês intermediário": "Intermediate English",
  "Compreensão e comunicação em inglês intermediário.": "Intermediate-level understanding and communication in English.",
  "TDD": "TDD",
  "Testes unitários e de integração usando Jest, React Testing Library e Mock Service Worker (MSW)": "Unit and integration testing using Jest, React Testing Library, and Mock Service Worker (MSW)",
  "Conhecimentos em Backend": "Backend Knowledge",
  "NodeJS e Express": "NodeJS and Express",
  "Experiência no desenvolvimento de aplicativos utilizando o ambiente de execução do Nodejs e Express.": "Experience in developing applications using the Node.js runtime environment and Express.",
  "NestJS": "NestJS",
  "Prisma": "Prisma",
  "Familiaridade com o framework NestJS para construção de aplicativos server-side.": "Familiarity with the NestJS framework for building server-side applications.",
  "Experiência no uso do Prisma como ORM (Object-Relational Mapping) para interagir com bancos de dados.": "Experience in using Prisma as an Object-Relational Mapping (ORM) to interact with databases.",

  "Me manda um salve! ;)": "Say hello! ;)",
  "De (email)": "From (email)",
  "Assunto": "Subject",
  "Mensagem": "Message",
  "Enviar": "Send",
  "Enviando Email...": "Sending Email..."
}
